# CutLineColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..CutLineColor Property
OverrideGraphicSettings Class See Also
---
Cut surface line color.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color CutLineColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutLineColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ CutLineColor {
	Color^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace